---
kind: method
id: M:Autodesk.Revit.DB.PolylineNode.GetPolyline
source: html/1c93fc3a-adbb-bb5a-92e4-923f46b45b28.htm
---
# Autodesk.Revit.DB.PolylineNode.GetPolyline Method

Returns the polyline object corresponding to the node.

## Syntax (C#)
```csharp
public PolyLine GetPolyline()
```

## Returns
The polyline instance.